What does a Game Designer do&
Kai Wüest
https://kreidenwerk.com/insights/game-designer/

# День в роли геймдизайнера

![Кодзима - гений](https://i0.wp.com/kreidenwerk.com/wp-content/uploads/2019/07/HideoKojimaGameDesigner.jpg?w=1000&ssl=1)

Легендарный геймдизайнер. Человек, миф, легенда, стоящая за игрой. Источник вдохновения для юных мечтателей, желающих однажды работать в игровой индустрии. Но чем занимается геймдизайнер на самом деле? И как вам стать одним из них?

Давайте сразу разберемся с одним недопониманием: геймдизайнеры - это не "ребята с идеями". Конечно, им в голову иногда приходят идеи, которые часто превращаются в фичи, но 99% их работы - это попытки проработать эти идеи в мельчайших деталях. Мы точно не будете сидеть за круглым столом и обсуждать "zombie survival shooter RPG", а перед уходом домой хлопать друг друга по плечу.

Вместо этого вы будете 3 часа тратить на попытку понять, должен кулдаун у двойного прыжка на 400/200 единиц, со скоростью 550 единиц/с и затратами сил в 30 единиц быть 2,5 секунд или 3 секунды. И если вам не повезет, вы будете получать гневные письма от злых игроков, чье-го персонажа вы понерфили с последним патчем.

# Основы геймдизайна

Геймдизайнеры отвечают за правила, системы, механики и контент видеоигры. Они работают в командах и часто бывают разделены в группы с разными специализациями, такими как дизайн систем, дизайн уровней и игровой баланс.

Несмотря на то, что я считаю геймдизайн больше искусством, нежели точной наукой, это все-таки является областью разработки ПО, и поэтому вы в основном будете использовать стандартные приложения для работы. Вот некоторые, с которыми мне приходилось сталкиваться:

- Таблицы по выбору, например, Excel или Google Sheets
- Средство документации, например, вики или ручка с бумагой
- Игровой движок, например, Unreal Engine 4 или Unity
- Система контроля версий, например, Git или Perforce
- Скриптовый язык, например, Python или Lua
- Собственный редактор уровней, например, Hammer Editor или Fallout Creation Kit

Скорее всего свою карьеру в геймдеве вы начнете с должности стажера или младшего дизайнера. Высшее образованиие в области геймдизайна или разработки ПО будет плюсом, но качество и количество проектов в вашем портфолио играет намного большую роль. Умение программировать и красиво писать поможет вам выделиться из толпы геймдизайнеров, а если вы уже опубликовали игру или приложение, то вы уже далеко впереди своих конкурентов. Больше об этом - позже.

**То, что вы играли в игры прежде не дает вам преимущества (скорее это даже необходимость), ведь это не является навыком.**

# Пять стадий ~~горя~~ разработки игр

Видеоигры, как и другое ПО, проходят различные этапы разработки, и работа геймдизайнера меняется в соответствие с ними. Имейте ввиду, что методологии и философии разнятся от места к месту, поэтому даже такой общий обзор может не соответствовать разработке в некоторых студиях.

# 1. Pre-production

После питчей об игре, встреч и мыслей в душе, начальство утверждает бюджет, масштаб, целевую аудиторию и примерную дату выхода игры. После этого небольшой команде поручается создание прототипа.

[Прототип Rocket League](https://youtu.be/iib978cQJh8)

Ваша задача здесь - концептуализировать и актуализировать основной геймплей. Подумайте, как привести идею "летающие машины бьют по мячу" или "бесплатный шутер, в котором карта со временем становится меньше" к состоянию, при котором в это уже можно будет играть и вы сможете видеть, почему это весело.

Такой прототип подчеркивает основные механики, вид и ощущения от игры, а также ее коммерческую ценность. Он также должен пролить свет на то, сколько сил потребуется для завершения игры. Что наиболее важно, этот прототип должен убедить менеджмент. Более подробную информацию о прототипировании можно найти [здесь](https://medium.com/@ppolsinelli/what-is-a-game-prototype-506472ec67ad).

# 2. Полный вперед

После того, как прототип продемонстрирован и финансирование получено, проект переходит на этап production и получает весь необходимый персонал. Как было отмечено выше, геймдизайн имеет много специализаций, которые мы рассмотрим ниже.

# Дизайн систем
